#include "Com.h"

ComPortAdapter::ComPortAdapter() {}

QString ComPortAdapter::receptionConfig()
{
    QString config = "1{Цех, 2{Автоклав 1, 3{температура, 0, 1, 174, °С}, 3{Давление, 0, 1, 203, кПа}, 3{Уровень 1, 0, 1, 1,}, 3{Уровень 2, 0, 1, 0,}, 4{Клапан сжатый воздух, binary, 1}, 4{КЗР, binary, 0}, 4{Клапан вода, binary, 0}, 4{Клапан пар, binary, 1}, 4{Клапан сброс, binary, 0}, 4{Клапан дренаж, binary, 1}}";
    config += ", 2{Автоклав 2, 3{температура, 0, 1, 256, °С}, 3{Давление, 0, 1, 311, кПа}, 3{Уровень 1, 0, 1, 1,}, 3{Уровень 2, 0, 1, 0,}, 4{Клапан сжатый воздух, binary, 0}, 4{КЗР, binary, 1}, 4{Клапан вода, binary, 1}, 4{Клапан пар, binary, 0}, 4{Клапан сброс, binary, 0}, 4{Клапан дренаж, binary, 0}}";
    config += ", 3{Давление в пневмосистеме, 0, 1, 510, кПа} , 3{Давление в водопроводе, 0, 1, 530, кПа} , 3{Давление паропроводе, 0, 1, 460, кПа} , 3{Температура в цеху, 0, 1, 23, °С}}";
    return config;
}
